Revit 2027 API
BuiltInFailures.CopyPasteFailures.CannotPasteDifferentViewSpecificElements Property
 Cannot paste view-specific elements from different views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotPasteDifferentViewSpecificElements { get; }
Public Shared ReadOnly Property CannotPasteDifferentViewSpecificElements As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotPasteDifferentViewSpecificElements {
	FailureDefinitionId^ get ();
}
static member CannotPasteDifferentViewSpecificElements : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace